modules/common/src/test/resources/com/l7tech/common/resources/placeOrder_encrypted_aes128gcm.xml

<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <wsse:Security soapenv:actor="secure_span"
            soapenv:mustUnderstand="1"
            xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsu:Timestamp>
                <wsu:Created>2011-11-02T05:25:06.238072685Z</wsu:Created>
                <wsu:Expires>2011-11-02T05:30:06.238Z</wsu:Expires>
            </wsu:Timestamp>
            <xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
                <xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/>
                <dsig:KeyInfo xmlns:dsig="http://www.w3.org/2000/09/xmldsig#">
                    <wsse:SecurityTokenReference>
                        <wsse:KeyIdentifier
                            EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509SubjectKeyIdentifier">Xeg55vRyK3ZhAEhEf+YT0z986L0=</wsse:KeyIdentifier>
                    </wsse:SecurityTokenReference>
                </dsig:KeyInfo>
                <xenc:CipherData>
                    <xenc:CipherValue>q01nc7tHPEbGaLlZCqPCvyZo3w19NAtR6jp3yHMQIBb2IDvsOvBGp8gdKturqsr031rf0WCnBN+crwC+suABaerRCLBaD+uVOYA4C5Yi+obDPuFWFosazR2fMIAN0ZWJsJ66IIchz4GUVqi0UrVBsYZwa+fCidzTYltK/O/W7rg=</xenc:CipherValue>
                </xenc:CipherData>
                <xenc:ReferenceList>
                    <xenc:DataReference URI="#Body-0-47b01febcfef1ce17eeae3e72125cbd9"/>
                </xenc:ReferenceList>
            </xenc:EncryptedKey>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <EncryptedData Id="Body-0-47b01febcfef1ce17eeae3e72125cbd9"
            Type="http://www.w3.org/2001/04/xmlenc#Content" xmlns="http://www.w3.org/2001/04/xmlenc#">
            <EncryptionMethod Algorithm="http://www.w3.org/2009/xmlenc11#aes128-gcm"/>
            <CipherData>
                <CipherValue>JQyIeL6JY6s+tayURX3ecXWY3SKK24o4+tHEnn8ldYC1apozwsyzsLvvvyBI6YVxzMZW76ca0a2Ntyz5WL3c3EAoCJSFjTBK/gPPTWBBcvNn6CeDhEuuqorIaWB2GrBzORH+qfuLHDQ/7TA/vQ5WkTcgjPFEmHx9CpD3pE7hkXzAXHwPi9NBg4dBU778NPvtdlvhkDklm2x8WZ1ckE/dWA3kWs0YSkMTvmdRQNU+VcFKCbsjUb7wgyizpdaerj+EzDN9GXgjrBHSqAwQdGojAFNk4URGO6mNdb0Pe2qadsDRMWgQA/TrbJZlYQFGzAAkWUAAV9Wz9MRj7QugTSk7dUmV3pWEAZhqM2ZJ785kA2c+9xMfV4DKYzUJffkKL60OeswMM1XrezD9Jnt7bm6til6AyKG3Ahr5pIgYzLbDQ4ajoEBeQCE5qgpMr7QYHu8O2g88TVD47R4ha41xaLNeG+WbCMbO/xvFFln8tu/KRvNrjJLJMrM15Yff38zX+xUzhqMjCUCAnKBMP/aTZCWhQVBFsgMAiPYG32OHHfFUTYJ1G0rRErF8Tu/5QWcP</CipherValue>
            </CipherData>
        </EncryptedData>
    </soapenv:Body>
</soapenv:Envelope>
